### Data Frames

In [2]:
import pandas as pd
import numpy as np

In [3]:
df = pd.DataFrame()
df

Empty DataFrame
Columns: []
Index: []

In [4]:
print(df)

Empty DataFrame
Columns: []
Index: []

In [6]:
df1 = pd.DataFrame([[1,5,4,7],[4,8,12,36],[45,52,12,30],[45,17,89,63],[20,37,4,9]])
df1

    0   1   2   3
0   1   5   4   7
1   4   8  12  36
2  45  52  12  30
3  45  17  89  63
4  20  37   4   9

In [8]:
df1.head(2)  # show elements from top

   0  1   2   3
0  1  5   4   7
1  4  8  12  36

In [9]:
df1.tail(2)  # show elements from end

    0   1   2   3
3  45  17  89  63
4  20  37   4   9

In [10]:
df1.shape

(5, 4)

### Data Frame Slicing

In [13]:
df1

    0   1   2   3
0   1   5   4   7
1   4   8  12  36
2  45  52  12  30
3  45  17  89  63
4  20  37   4   9

In [14]:
df1.iloc[1:3,0:3]

    0   1   2
1   4   8  12
2  45  52  12

In [15]:
df1.iloc[0:4,2:4]

    2   3
0   4   7
1  12  36
2  12  30
3  89  63

### Setting Headers in Data Frame

In [17]:
df2 = pd.DataFrame([[1,5,4,7],[4,8,12,36],[45,52,12,30],[45,17,89,63],[20,37,4,9]], columns=['first','second','third','fourth'])
df2

   first  second  third  fourth
0      1       5      4       7
1      4       8     12      36
2     45      52     12      30
3     45      17     89      63
4     20      37      4       9